In [2]:
import numpy as np
import pandas as pd

In [5]:
revenues = pd.Series([555, 7000, 1980])

In [6]:
revenues

0     555
1    7000
2    1980
dtype: int64

In [4]:
pd.Series([1, 2, 3, 4, 5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
revenues.values

array([ 555, 7000, 1980], dtype=int64)

In [8]:
revenues.index

RangeIndex(start=0, stop=3, step=1)

In [9]:
city_revenues = pd.Series(
    [4200,8000, 6500],
    index=["Amsterdam", "totonto", "tokyo"]
)
city_revenues

Amsterdam    4200
totonto      8000
tokyo        6500
dtype: int64

In [10]:
city_revenues.index

Index(['Amsterdam', 'totonto', 'tokyo'], dtype='object')

In [61]:
city_employee_count = pd.Series({"Amsterdam": 5, "tokyo": 8})
city_employee_count

Amsterdam    5
tokyo        8
dtype: int64

In [13]:
city_employee_count.keys()

Index(['Amsterdam', 'Tokyo'], dtype='object')

In [21]:
city_data = pd.DataFrame({
    "revenue": city_revenues,
    "employee_count": city_employee_count
})
city_data

           revenue  employee_count
Amsterdam   4200.0             5.0
Tokyo          NaN             8.0
tokyo       6500.0             NaN
totonto     8000.0             NaN

In [20]:
city_data

           revenue  employee_count
Amsterdam   4200.0             5.0
Tokyo          NaN             8.0
tokyo       6500.0             NaN
totonto     8000.0             NaN

In [22]:
city_data.index

Index(['Amsterdam', 'Tokyo', 'tokyo', 'totonto'], dtype='object')

In [23]:
city_data.values

array([[4.2e+03, 5.0e+00],
       [    nan, 8.0e+00],
       [6.5e+03,     nan],
       [8.0e+03,     nan]])

In [25]:
city_data.axes

[Index(['Amsterdam', 'Tokyo', 'tokyo', 'totonto'], dtype='object'),
 Index(['revenue', 'employee_count'], dtype='object')]

In [28]:
city_data.axes[0]

Index(['Amsterdam', 'Tokyo', 'tokyo', 'totonto'], dtype='object')

In [29]:
city_data.axes[1]

Index(['revenue', 'employee_count'], dtype='object')

In [30]:
city_data.keys()

Index(['revenue', 'employee_count'], dtype='object')

In [32]:
"Amsterdam" in city_data

False

In [33]:
"revenue" in city_data

True

In [37]:
city_revenues['totonto']

8000

In [40]:
city_revenues["Amsterdam"]

4200

In [41]:
city_revenues[-1]

6500

In [42]:
city_revenues.keys

<bound method Series.keys of Amsterdam    4200
totonto      8000
tokyo        6500
dtype: int64>

In [43]:
city_revenues.index

Index(['Amsterdam', 'totonto', 'tokyo'], dtype='object')

In [44]:
city_revenues[1:]

totonto    8000
tokyo      6500
dtype: int64

In [46]:
city_revenues["totonto":]

totonto    8000
tokyo      6500
dtype: int64

In [53]:
colors = pd.Series(
    ["red", "purple", "blue", "green", "yellow"],
    index=[1, 2, 3, 5, 8]
)

In [54]:
colors

1       red
2    purple
3      blue
5     green
8    yellow
dtype: object

In [55]:
colors.loc[1]

'red'

In [56]:
colors.loc[5]

'green'

In [58]:
colors.loc[3:8]
#loc label

3      blue
5     green
8    yellow
dtype: object

In [59]:
colors.iloc[3:8]

5     green
8    yellow
dtype: object

In [ ]:
.iloc similar []
.loc similar []

In [62]:
city_data

           revenue  employee_count
Amsterdam   4200.0             5.0
Tokyo          NaN             8.0
tokyo       6500.0             NaN
totonto     8000.0             NaN

In [66]:
toys = pd.DataFrame([{"name": "ball", "shape":"sphere"}, 
{"name": "Rubik's cube", "shape": "cube"}])

In [67]:
toys

           name   shape
0          ball  sphere
1  Rubik's cube    cube

In [68]:
toys.shape

(2, 2)

In [69]:
toys["shape"]

0    sphere
1      cube
Name: shape, dtype: object

In [70]:
city_data

           revenue  employee_count
Amsterdam   4200.0             5.0
Tokyo          NaN             8.0
tokyo       6500.0             NaN
totonto     8000.0             NaN

In [71]:
city_data.loc["Amsterdam"]

revenue           4200.0
employee_count       5.0
Name: Amsterdam, dtype: float64

In [74]:
city_data.loc["tokyo":"totonto"]

         revenue  employee_count
tokyo     6500.0             NaN
totonto   8000.0             NaN

In [77]:
city_data.iloc[1:3]

       revenue  employee_count
Tokyo      NaN             8.0
tokyo   6500.0             NaN

In [79]:
city_data.loc["Amsterdam":"tokyo", ['revenue','employee_count']]

           revenue  employee_count
Amsterdam   4200.0             5.0
Tokyo          NaN             8.0
tokyo       6500.0             NaN

In [80]:
city_revenues

Amsterdam    4200
totonto      8000
tokyo        6500
dtype: int64

In [81]:
city_revenues.sum()

18700

In [82]:
city_revenues.max()

8000

In [83]:
city_data.sum()

revenue           18700.0
employee_count       13.0
dtype: float64

In [87]:
city_data.revenue.sum()

18700.0

In [92]:
furher_city_data = pd.Data.Frame(
    {"revenue": [7000, 340], "employee_count": [2, 2],
    index= {"New York", "Barcelona"}
)

SyntaxError: invalid syntax (<ipython-input-92-8f008c985640>, line 3)

In [ ]:
pd.merge()